using System;
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Data : MonoBehaviour
{
    public List<string> data = new List<string>() {
"あいだ", "あいて", "あお", "あか", "あさ", "あさごはん", "あさって", "あし", "あす", "あそこ", "あたま", "あちら", "あと", "あなた", "あに", "あめ", "あれ", "あんぜん", 
"いいん", "いえ", "いか", "いがい", "いけん", "いしき", "いじょう", "いす", "いずれ", "いぜん", "いち", "いちぶ", "いっしゅうかん", "いっしょ", "いっぱん", "いつ", "いつつ", "いぬ", "いま", "いみ", "いりょう", "いろ", 
"うえ", "うしろ", "うち", "うで", "うみ", "うんてん", "うんどう", 
"え", "えいが", "えいきょう", "えき", "えん", "えんぴつ", 
"おおく", "おかあさん", "おく", "おく", "おじ", "おじいさん", "おっと", "おと", "おとうさん", "おとこ", "おととい", "おなか", "おば", "おばあさん", "おまえ", "おや", "おんがく", "おんな", 
"か", "かい", "かい", "かい", "かいぎ", "かいしゃ", "かお", "かかく", "かがく", "かぎ", "かくにん", "かげつ", "かこ", "かさ", "かぜ", "かぜ", "かぞく", "かた", "かたかな", "かたち", "かつどう", "かね", "かのじょ", "かばん", "かべ", "かみ", "かみ", "かみ", "かようび", "からだ", "かれ", "かれら", "かわ", "かん", "かんきょう", "かんけい", "かんこく", "かんじ", "かんり", "がいこく", "がく", "がっこう", "がわ", 
"き", "き", "き", "き", "きいろ", "きかん", "きかん", "きけん", "きじゅん", "きた", "きたい", "きって", "きっぷ", "きのう", "きのう", "きほん", "きみ", "きもち", "きもの", "きゃく", "きゅう", "きょう", "きょういく", "きょうりょく", "きょく", "きん", "きんようび", "ぎじゅつ", "ぎんこう", 
"くうき", "くうこう", "くさ", "くだもの", "くち", "くつ", "くつした", "くに", "くび", "くもり", "くるま", "くろ", "ぐん", 
"け", "けいえい", "けいかく", "けいけん", "けいさつ", "けいざい", "けいやく", "けが", "けっか", "けっこん", "けってい", "けん", "けんきゅう", "けんこう", "けんとう", "げつようび", "げんいん", "げんかん", "げんざい", 
"こうか", "こうこう", "こうじょう", "こうぞう", "こうつう", "こうどう", "こえ", "こくさい", "こくみん", "ここ", "ここのつ", "こころ", "こじん", "こちら", "こと", "ことし", "ことば", "こども", "こめ", "これ", "ころ", "こんかい", "こんご", "こんど", "ご", "ご", "ごう", "ごご", "ごぜん", "ごはん", 
"さい", "さいきん", "さいご", "さいしょ", "さかな", "さき", "さぎょう", "さくせい", "さくひん", "さとう", "さん", "さんか", "さんぎょう", 
"し", "し", "しお", "しき", "しごと", "しぜん", "した", "しち", "しつもん", "してい", "しどう", "しみん", "しゃ", "しゃかい", "しゃしん", "しゅう", "しゅうかん", "しゅぎ", "しょうかい", "しょうがい", "しょうひ", "しょうひん", "しょうゆ", "しょうらい", "しょくじ", "しょり", "しよう", "しりょう", "しろ", "しんたい", "しんぱい", "しんぶん", "じ", "じかん", "じき", "じけん", "じこ", "じしょ", "じしん", "じだい", "じっさい", "じっし", "じてんしゃ", "じどう", "じぶん", "じむ", "じゅう", "じゅうたく", "じゆう", "じょうきょう", "じょうけん", "じょうたい", "じょうほう", 
"すいようび", "すう", "すがた", "すべて", "ず", 
"せいかつ", "せいき", "せいさん", "せいしん", "せいじ", "せいど", "せいび", "せいふ", "せかい", "せきにん", "せつめい", "せなか", "せん", "せんせい", "せんそう", "せんたく", "せんもん", "ぜい", "ぜんこく", "ぜんたい", 
"そうだん", "そこ", "そしき", "そちら", "そと", "そふ", "そぼ", "そら", "それ", "それぞれ", "そんざい", 
"た", "たいさく", "たいしょう", "たいふう", "たたみ", "ため", "だい", "だい", "だいがく", "だいじん", "だいどころ", "だいひょう", "だめ", "だれ", "だんたい", 
"ち", "ち", "ちいき", "ちかく", "ちから", "ちほう", "ちゃ", "ちゃわん", "ちゅうい", "ちゅうおう", "ちゅうごく", "ちゅうしん", "ちょうさ", "ちり", 
"ついたち", "つき", "つき", "つぎ", "つくえ", "つま", "つめ", "つもり", 
"て", "ていど", "てがみ", "てまえ", "てん", "てんき", "でんき", "でんしゃ", "でんわ", 
"と", "とうじ", "とお", "とおり", "とき", "ところ", "とし", "とし", "とち", "ともだち", "とり", "ど", "どう", "どうぐ", "どうじ", "どうぶつ", "どうろ", "どこ", "どちら", "どようび", "どれ", 
"ないよう", "なか", "ななつ", "なに", "なまえ", 
"に", "にく", "にし", "にちようび", "にっぽん", "にんげん", 
"ぬりえ",
"ねこ", "ねんかん", "ねんど", 
"のり",
"は", "は", "はし", "はず", "はち", "はな", "はな", "はれ", "はん", "はんだん", "はんばい", "ばあい", "ばしょ", "ばん", "ばん", 
"ひ", "ひ", "ひかり", "ひがし", "ひげ", "ひこうき", "ひだり", "ひつよう", "ひと", "ひとつ", "ひとびと", "ひとり", "ひゃく", "ひょう", "ひょうか", "ひょうげん", "ひらがな", "ひる", "ひるごはん", "びょう", "びょういん", "びょうき", 
"ふう", "ふく", "ふたつ", "ふたり", "ふつう", "ふとん", "ふろ", "ふん", "ぶ", "ぶどう", "ぶぶん", "ぶん", "ぶんか", 
"へや", "へんか", "べつ", "べんきょう", 
"ほう", "ほう", "ほうこく", "ほうそう", "ほうほう", "ほうりつ", "ほか", "ほし", "ほとんど", "ほん", "ほんだな", "ほんとう", "ぼく", 
"まいにち", "まえ", "まど", "まま", "まん", "まんなか", 
"み", "みぎ", "みず", "みせ", "みち", "みっつ", "みどり", "みな", "みなみ", "みみ", 
"むし", "むすめ", "むっつ", "むね", "むり", 
"め", "めがね", "めん", 
"もくてき", "もくようび", "もじ", "もと", "もの", "もの", "もんだい", 
"やく", "やさい", "やっつ", "やま", 
"ゆ", "ゆうがた", "ゆうごはん", "ゆき", "ゆび", "ゆめ", 
"ようび", "ようふく", "よっつ", "よてい", "よる", 
"らいおん", "らっぱ",
"りかい", "りつ", "りゆう", "りょう", "りょうり", "りよう", "りこん", "りぼん",
"れい", "れい", "れきし", "れんらく", 
"ろうか", "ろうどう", "ろく", 
"わけ", "わたし", "われわれ", 
"アパート", "アメリカ", "アラビア", "エスカレーター", "エレベーター", "カーテン", "ガス", "コップ", "コーヒー", "サラダ", "サービス", "シャープペンシル", "スペイン", "スポーツ", "センター", "タクシー", "テレビ", "テーブル", "トイレ", "ドア", "ドイツ", "ナイフ", "ネクタイ", "バス", "パソコン", "パン", "パーセント", "ベッド", "ペン", "ページ", "ホテル", "ボタン", "ボールペン", "メートル", "メール"};

    public List<string> sound50 = new List<string>()
    {
"あ", "い", "う", "え", "お",
"か", "き", "く", "け", "こ",
"さ", "し", "す", "せ", "そ",
"た", "ち", "つ", "て", "と",
"な", "に", "ぬ", "ね", "の",
"は", "ひ", "ふ", "へ", "ほ",
"ま", "み", "む", "め", "も",
"や", "ゆ", "よ",
"ら", "り", "る", "れ", "ろ",
"わ"
    };
    

    public static string[] a = new string[] {"あいだ", "あいて", "あお", "あか", "あさ", "あさごはん", "あさって", "あし", "あす", "あそこ", "あたま", "あちら", "あと", "あなた", "あに", "あめ", "あれ", "あんぜん", 
    };
    public static string[] i = new string[] {"いいん", "いえ", "いか", "いがい", "いけん", "いしき", "いじょう", "いす", "いずれ", "いぜん", "いち", "いちぶ", "いっしゅうかん", "いっしょ", "いっぱん", "いつ", "いつつ", "いぬ", "いま", "いみ", "いりょう", "いろ", 
    };
    public static string[] u = new string[] {"うえ", "うしろ", "うち", "うで", "うみ", "うんてん", "うんどう", 
    };
    public static string[] e = new string[] {"え", "えいが", "えいきょう", "えき", "えん", "えんぴつ", 
    };
    public static string[] o = new string[] {"おおく", "おかあさん", "おく", "おく", "おじ", "おじいさん", "おっと", "おと", "おとうさん", "おとこ", "おととい", "おなか", "おば", "おばあさん", "おまえ", "おや", "おんがく", "おんな", 
    };
    public static string[] ka = new string[] {"か", "かい", "かい", "かい", "かいぎ", "かいしゃ", "かお", "かかく", "かがく", "かぎ", "かくにん", "かげつ", "かこ", "かさ", "かぜ", "かぜ", "かぞく", "かた", "かたかな", "かたち", "かつどう", "かね", "かのじょ", "かばん", "かべ", "かみ", "かみ", "かみ", "かようび", "からだ", "かれ", "かれら", "かわ", "かん", "かんきょう", "かんけい", "かんこく", "かんじ", "かんり", "がいこく", "がく", "がっこう", "がわ", 
    };
    public static string[] ki = new string[] {"き", "き", "き", "き", "きいろ", "きかん", "きかん", "きけん", "きじゅん", "きた", "きたい", "きって", "きっぷ", "きのう", "きのう", "きほん", "きみ", "きもち", "きもの", "きゃく", "きゅう", "きょう", "きょういく", "きょうりょく", "きょく", "きん", "きんようび", "ぎじゅつ", "ぎんこう", 
    };
    public static string[] ku = new string[] {"くうき", "くうこう", "くさ", "くだもの", "くち", "くつ", "くつした", "くに", "くび", "くもり", "くるま", "くろ", "ぐん", 
    };
    public static string[] ke = new string[] {"け", "けいえい", "けいかく", "けいけん", "けいさつ", "けいざい", "けいやく", "けが", "けっか", "けっこん", "けってい", "けん", "けんきゅう", "けんこう", "けんとう", "げつようび", "げんいん", "げんかん", "げんざい", 
    };
    public static string[] ko = new string[] {"こうか", "こうこう", "こうじょう", "こうぞう", "こうつう", "こうどう", "こえ", "こくさい", "こくみん", "ここ", "ここのつ", "こころ", "こじん", "こちら", "こと", "ことし", "ことば", "こども", "こめ", "これ", "ころ", "こんかい", "こんご", "こんど", "ご", "ご", "ごう", "ごご", "ごぜん", "ごはん", 
    };
    public static string[] sa = new string[] {"さい", "さいきん", "さいご", "さいしょ", "さかな", "さき", "さぎょう", "さくせい", "さくひん", "さとう", "さん", "さんか", "さんぎょう", 
    };
    public static string[] si = new string[] { "し", "し", "しお", "しき", "しごと", "しぜん", "した", "しち", "しつもん", "してい", "しどう", "しみん", "しゃ", "しゃかい", "しゃしん", "しゅう", "しゅうかん", "しゅぎ", "しょうかい", "しょうがい", "しょうひ", "しょうひん", "しょうゆ", "しょうらい", "しょくじ", "しょり", "しよう", "しりょう", "しろ", "しんたい", "しんぱい", "しんぶん", "じ", "じかん", "じき", "じけん", "じこ", "じしょ", "じしん", "じだい", "じっさい", "じっし", "じてんしゃ", "じどう", "じぶん", "じむ", "じゅう", "じゅうたく", "じゆう", "じょうきょう", "じょうけん", "じょうたい", "じょうほう", 
    };
    public static string[] su = new string[] { "すいようび", "すう", "すがた", "すべて", "ず", 
    };
    public static string[] se = new string[] { "せいかつ", "せいき", "せいさん", "せいしん", "せいじ", "せいど", "せいび", "せいふ", "せかい", "せきにん", "せつめい", "せなか", "せん", "せんせい", "せんそう", "せんたく", "せんもん", "ぜい", "ぜんこく", "ぜんたい", 
    };
    public static string[] so = new string[] {"そうだん", "そこ", "そしき", "そちら", "そと", "そふ", "そぼ", "そら", "それ", "それぞれ", "そんざい", 
    };
    public static string[] ta = new string[] {"た", "たいさく", "たいしょう", "たいふう", "たたみ", "ため", "だい", "だい", "だいがく", "だいじん", "だいどころ", "だいひょう", "だめ", "だれ", "だんたい", 
    };
    public static string[] ti = new string[] {"ち", "ち", "ちいき", "ちかく", "ちから", "ちほう", "ちゃ", "ちゃわん", "ちゅうい", "ちゅうおう", "ちゅうごく", "ちゅうしん", "ちょうさ", "ちり", 
    };
    public static string[] tu = new string[] {"ついたち", "つき", "つき", "つぎ", "つくえ", "つま", "つめ", "つもり", 
    };
    public static string[] te = new string[] {"て", "ていど", "てがみ", "てまえ", "てん", "てんき", "でんき", "でんしゃ", "でんわ", 
    };
    public static string[] to = new string[] {"と", "とうじ", "とお", "とおり", "とき", "ところ", "とし", "とし", "とち", "ともだち", "とり", "ど", "どう", "どうぐ", "どうじ", "どうぶつ", "どうろ", "どこ", "どちら", "どようび", "どれ", 
    };
    public static string[] na = new string[] {"ないよう", "なか", "ななつ", "なに", "なまえ", 
    };
    public static string[] ni = new string[] {"に", "にく", "にし", "にちようび", "にっぽん", "にんげん", 
    };
    public static string[] nu = new string[] {"ぬりえ",
    };
    public static string[] ne = new string[] {"ねこ", "ねんかん", "ねんど", 
    };
    public static string[] no = new string[] {"のり",
    };
    public static string[] ha = new string[] {"は", "は", "はし", "はず", "はち", "はな", "はな", "はれ", "はん", "はんだん", "はんばい", "ばあい", "ばしょ", "ばん", "ばん", 
    };
    public static string[] hi = new string[] {"ひ", "ひ", "ひかり", "ひがし", "ひげ", "ひこうき", "ひだり", "ひつよう", "ひと", "ひとつ", "ひとびと", "ひとり", "ひゃく", "ひょう", "ひょうか", "ひょうげん", "ひらがな", "ひる", "ひるごはん", "びょう", "びょういん", "びょうき", 
    };
    public static string[] hu = new string[] {"ふう", "ふく", "ふたつ", "ふたり", "ふつう", "ふとん", "ふろ", "ふん", "ぶ", "ぶどう", "ぶぶん", "ぶん", "ぶんか", 
    };
    public static string[] he = new string[] {"へや", "へんか", "べつ", "べんきょう", 
    };
    public static string[] ho = new string[] {"ほう", "ほう", "ほうこく", "ほうそう", "ほうほう", "ほうりつ", "ほか", "ほし", "ほとんど", "ほん", "ほんだな", "ほんとう", "ぼく", 
    };
    public static string[] ma = new string[] {"まいにち", "まえ", "まど", "まま", "まん", "まんなか", 
    };
    public static string[] mi = new string[] {"み", "みぎ", "みず", "みせ", "みち", "みっつ", "みどり", "みな", "みなみ", "みみ", 
    };
    public static string[] mu = new string[] {"むし", "むすめ", "むっつ", "むね", "むり", 
    };
    public static string[] me = new string[] {"め", "めがね", "めん", 
    };
    public static string[] mo = new string[] {"もくてき", "もくようび", "もじ", "もと", "もの", "もの", "もんだい", 
    };
    public static string[] ya = new string[] {"やく", "やさい", "やっつ", "やま", 
    };
    public static string[] yu = new string[] {"ゆ", "ゆうがた", "ゆうごはん", "ゆき", "ゆび", "ゆめ", 
    };
    public static string[] yo = new string[] {"ようび", "ようふく", "よっつ", "よてい", "よる", 
    };
    public static string[] ra = new string[] {"らいおん", "らっぱ",
    };
    public static string[] ri = new string[] {"りかい", "りつ", "りゆう", "りょう", "りょうり", "りよう", "りこん", "りぼん"
    };
    public static string[] ru = new string[] {"るーる"};
    public static string[] re = new string[] {"れい", "れい", "れきし", "れんらく", 
    };
    public static string[] ro = new string[] {"ろうか", "ろうどう", "ろく", 
    };
    public static string[] wa = new string[] {"わけ", "わたし", "われわれ", 
    };
    
    public Dictionary<string, string[]> sound50Index = new Dictionary<string, string[]>()
    {
        {"あ", a}, {"い", i}, {"う", u}, {"え", e}, {"お", o},
        {"か", ka}, {"き", ki}, {"く", ku}, {"け", ke}, {"こ", ko},
        {"さ", sa}, {"し", si}, {"す", su}, {"せ", se}, {"そ", so},
        {"た", ta}, {"ち", ti}, {"つ", tu}, {"て", te}, {"と", to},
        {"な", na}, {"に", ni}, {"ぬ", nu}, {"ね", ne}, {"の", no},
        {"は", ha}, {"ひ", hi}, {"ふ", hu}, {"へ", he}, {"ほ", ho},
        {"ま", ma}, {"み", mi}, {"む", mu}, {"め", me}, {"も", mo},
        {"や", ya}, {"ゆ", yu}, {"よ", yo},
        {"ら", ra}, {"り", ri}, {"る", ru}, {"れ", re}, {"ろ", ro},
        {"わ", wa}
    }; 
}
